Revit 2027 API
FormatOptions(ForgeTypeId) Constructor
 Creates a new FormatOptions object that represents custom formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions(
	ForgeTypeId unitTypeId
)
Public Sub New (
	unitTypeId As ForgeTypeId
)
public:
FormatOptions(
	ForgeTypeId^ unitTypeId
)
new :
        unitTypeId : ForgeTypeId -> FormatOptions
Parameters
unitTypeId ForgeTypeId
 Identifier of the unit to display.
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormatOptions Class
FormatOptions Overload
Autodesk.Revit.DB Namespace